src_ext/InformationRegisters/УЗ_СоставГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_СоставГрупп</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Состоит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_ПереводУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПереводУченика</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_ГруппыОбучения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УЗ_СоставГрупп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИз</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВ</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>150</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
					<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
							<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыОбученияПрежние</Name>
					<Comment>Только для шага обновления данных 6: группы из карточки прежней версии переносятся в регистр УЗ_СоставГрупп (В29). Программа их больше не читает и не пишет</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_СоставГрупп/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Состав групп — единственный источник истины «кто в группе на дату» (решение владельца 28.09.2026, В29: как кадровая
//история в типовых). Записи пишет только документ «Перевод ученика» (Документы.УЗ_ПереводУченика): Состоит = Истина —
//с этого дня ученик в группе, Ложь — с этого дня выбыл. Ученик в группе на дату, если последняя запись пары
//«ученик — группа» на эту дату (период — день) — «Состоит». Помощник уроков, продление группы, запись урока группы,
//карточка ученика, первый запуск — все берут состав отсюда (прежде — строки табличной части карточки ученика).

//Состав группы на дату урока — одно правило для помощника уроков, продления группы и календаря: срез последних на
//дату, без педагогов, выбывших (отметка «Выбыл», В18) и помеченных на удаление. Массив ссылок, по наименованию.
Функция СоставГруппыНаДату(ГруппаОбучения, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Состав.Ученик КАК Ученик,
	|	Состав.Ученик.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.УЗ_СоставГрупп.СрезПоследних(&Дата, ГруппаОбучения = &ГруппаОбучения) КАК Состав
	|ГДЕ
	|	Состав.Состоит
	|	И НЕ Состав.Ученик.ПометкаУдаления
	|	И НЕ Состав.Ученик.ЭтоПедагог
	|	И НЕ Состав.Ученик.Выбыл
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ученик");

КонецФункции

//"" — ученик в группе на дату; иначе причина словами для сообщения (урок ученика с «Только выбранные группы»,
//запись урока группы помощником).
Функция ПричинаНеВГруппе(Ученик, ГруппаОбучения, Дата) Экспорт

	Ученики = Новый Массив;
	Ученики.Добавить(Ученик);
	Группы = Новый Массив;
	Группы.Добавить(ГруппаОбучения);
	Возврат ПричинаПоИстории(ИсторияПар(Ученики, Группы), Ученик, ГруппаОбучения, Дата);

КонецФункции

//Ученик в группе на дату (ПричинаНеВГруппе).
Функция ВГруппеНаДату(Ученик, ГруппаОбучения, Дата) Экспорт
	Возврат ПустаяСтрока(ПричинаНеВГруппе(Ученик, ГруппаОбучения, Дата));
КонецФункции

//Ученики из списка, которых нельзя записать в урок группы на дату (В18, В29) — Соответствие «ученик → причина
//словами»: выбывший (отметка «Выбыл») — всегда; ученик, у которого есть история в этой группе, но на дату урока он
//в ней не состоит (ещё не зачислен, переведён в другую, выбыл). Ученика без истории в группе (добавлен в урок
//вручную) не отбрасываем. Для записи уроков группы помощником — на дату КАЖДОГО урока.
Функция НеЗаписыватьВУрокГруппы(ГруппаОбучения, Ученики, Дата) Экспорт

	Итог = Новый Соответствие;
	Если Ученики.Количество() = 0 Или Не ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизЛица.Ссылка КАК Ученик
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка В (&Ученики)
	|	И ФизЛица.Выбыл";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Для Каждого Выбывший Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ученик") Цикл
		Итог.Вставить(Выбывший, НСтр("ru = 'выбыл (отметка «Выбыл» в карточке ученика)'"));
	КонецЦикла;

	Группы = Новый Массив;
	Группы.Добавить(ГруппаОбучения);
	История = ИсторияПар(Ученики, Группы);
	Для Каждого Ученик Из Ученики Цикл
		Если Итог[Ученик] <> Неопределено Или История.Найти(Ученик, "Ученик") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Причина = ПричинаПоИстории(История, Ученик, ГруппаОбучения, Дата);
		Если Не ПустаяСтрока(Причина) Тогда
			Итог.Вставить(Ученик, Причина);
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Ученики из списка (по порядку) без единой записи в этой группе (записывали только в уроки — старые данные), не
//выбывшие и не помеченные на удаление: продление группы оставляет их в уроках группы.
Функция УченикиБезИсторииВГруппе(ГруппаОбучения, Ученики) Экспорт

	Итог = Новый Массив;
	Если Ученики.Количество() = 0 Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ученики.Ссылка КАК Ученик
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК Ученики
	|ГДЕ
	|	Ученики.Ссылка В (&Ученики)
	|	И НЕ Ученики.Выбыл
	|	И НЕ Ученики.ПометкаУдаления
	|	И НЕ Ученики.Ссылка В
	|				(ВЫБРАТЬ
	|					Состав.Ученик
	|				ИЗ
	|					РегистрСведений.УЗ_СоставГрупп КАК Состав
	|				ГДЕ
	|					Состав.ГруппаОбучения = &ГруппаОбучения)";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
	Подходят = Новый Соответствие;
	Для Каждого Ученик Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ученик") Цикл
		Подходят.Вставить(Ученик, Истина);
	КонецЦикла;
	Для Каждого Ученик Из Ученики Цикл
		Если Подходят[Ученик] = Истина Тогда
			Итог.Добавить(Ученик);
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Группы ученика для карточки: ТаблицаЗначений ГруппаОбучения, ДатаНачала, ДатаОкончания (пустая — состоит сейчас),
//Документ (последний документ интервала) — интервалы членства, свежие сверху.
Функция ГруппыУченика(Ученик) Экспорт

	Итог = Новый ТаблицаЗначений;
	Итог.Колонки.Добавить("ГруппаОбучения", Новый ОписаниеТипов("СправочникСсылка.УЗ_ГруппыОбучения"));
	Итог.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Итог.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Итог.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.УЗ_ПереводУченика"));
	Если Не ЗначениеЗаполнено(Ученик) Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Состав.ГруппаОбучения КАК ГруппаОбучения,
	|	Состав.Период КАК Период,
	|	Состав.Состоит КАК Состоит,
	|	Состав.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.УЗ_СоставГрупп КАК Состав
	|ГДЕ
	|	Состав.Ученик = &Ученик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Состав.ГруппаОбучения.Наименование,
	|	Состав.Период";
	Запрос.УстановитьПараметр("Ученик", Ученик);
	Выборка = Запрос.Выполнить().Выбрать();
	Открытые = Новый Соответствие;     //группа → открытая строка интервала
	Пока Выборка.Следующий() Цикл
		Открыта = Открытые[Выборка.ГруппаОбучения];
		Если Выборка.Состоит И Открыта = Неопределено Тогда
			Интервал = Итог.Добавить();
			Интервал.ГруппаОбучения = Выборка.ГруппаОбучения;
			Интервал.ДатаНачала = Выборка.Период;
			Интервал.Документ = Выборка.Документ;
			Открытые.Вставить(Выборка.ГруппаОбучения, Интервал);
		ИначеЕсли Не Выборка.Состоит И Открыта <> Неопределено Тогда
			Открыта.ДатаОкончания = Выборка.Период - 86400;
			Открыта.Документ = Выборка.Документ;
			Открытые.Удалить(Выборка.ГруппаОбучения);
		КонецЕсли;
	КонецЦикла;
	Итог.Сортировать("ДатаНачала Убыв");
	Возврат Итог;

КонецФункции

//История пар «ученик — группа»: ТаблицаЗначений Ученик, ГруппаОбучения, Период, Состоит, Регистратор по периоду.
//ИсключитьРегистратор — записи этого документа не берутся (документ перевода проверяет состав «без себя»).
Функция ИсторияПар(Ученики, Группы, ИсключитьРегистратор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Состав.Ученик КАК Ученик,
	|	Состав.ГруппаОбучения КАК ГруппаОбучения,
	|	Состав.Период КАК Период,
	|	Состав.Состоит КАК Состоит,
	|	Состав.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.УЗ_СоставГрупп КАК Состав
	|ГДЕ
	|	Состав.Ученик В (&Ученики)
	|	И Состав.ГруппаОбучения В (&Группы)
	|	И Состав.Регистратор <> &ИсключитьРегистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Запрос.УстановитьПараметр("Группы", Группы);
	Запрос.УстановитьПараметр("ИсключитьРегистратор", ?(ИсключитьРегистратор = Неопределено,
		Документы.УЗ_ПереводУченика.ПустаяСсылка(), ИсключитьРегистратор));
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//"" — по истории (ТаблицаЗначений с Ученик, ГруппаОбучения, Период, Состоит, по периоду; ИсторияПар) ученик в группе
//на дату; иначе причина словами. Одно правило для проверок урока, помощника и документа перевода.
Функция ПричинаПоИстории(История, Ученик, ГруппаОбучения, Дата) Экспорт

	День = НачалоДня(Дата);
	Последняя = Неопределено;
	Следующая = Неопределено;
	Для Каждого Запись Из История.НайтиСтроки(Новый Структура("Ученик, ГруппаОбучения", Ученик, ГруппаОбучения)) Цикл
		Если Запись.Период <= День Тогда
			Последняя = Запись;
		ИначеЕсли Следующая = Неопределено И Запись.Состоит Тогда
			Следующая = Запись;
		КонецЕсли;
	КонецЦикла;
	Если Последняя <> Неопределено И Последняя.Состоит Тогда
		Возврат "";
	ИначеЕсли Последняя <> Неопределено Тогда
		Возврат СтрШаблон(НСтр("ru = 'выбыл из группы %1 с %2'"), ГруппаОбучения, Формат(Последняя.Период, "ДЛФ=D"));
	ИначеЕсли Следующая <> Неопределено Тогда
		Возврат СтрШаблон(НСтр("ru = 'в группу %1 зачислен только с %2'"), ГруппаОбучения,
			Формат(Следующая.Период, "ДЛФ=D"));
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'не зачислен в группу %1 (нет документа «Перевод ученика»)'"), ГруппаОбучения);

КонецФункции

#КонецОбласти

#КонецЕсли
